#include <iostream>
//функція для виведення та введення даних у консоль
#include <cmath>
//для математичних обчислень

using namespace std;

int main() {
    //початкова функція програми,і вона є обов'язковою
    double A, B, C;
    // оголошення змінної числа з комою


    cout << "Введіть число A: ";
    //виведення даних(консоль)
    cin >> A;
    //зчитування введених даних
    cout << "Введіть число B: ";
    cin >> B;
    cout << "Введіть число C: ";
    cin >> C;
//обчислення середнього арифметичного
     double sum = A + B + C; 
//обчислення середнього геометричного
     double  product = A * B * C;
//визначаємо кількість значень 
    int n = 3;

double average_arithmetic = sum / n;
//формула для обчислення середнього арифметичного
double average_geometric = std::pow(product, 1.0 / n);
//формула для обчислення середнього геометричного

cout << "Середнє арифметичне: "
    << average_arithmetic << endl;
cout << "Середнє геометричне: "
    << average_geometric << endl;

return 0;
//успішне завершення програми

}