#include<iostream>
//функція для виведення і введення даних у консоль
using namespace std;
//повідомляє кампілятор,що ми хочемо використовувати,іменний простір
int main() {  
    //початкова функція,яка є обов'язковою для виконання програми  
 int number;
 //оголошення змінної
  cout << "Введіть число: ";
  //введення числа
   cin >> number;
   //зчитує ціле число,яке користувач ввів
    cout << "Дільники числа " << number << "у напрямку зростання; ";
     for (int i =1; i <=number; i++) {    

      if (number % i== 0) {
        // умова яка перевіряє чи є число дільником числа і
          cout << i << " ";
          //умова виконання,якщо і є дільником числа то вводиться значення і
              }

       }    

  cout <<endl;
  //перехід до нового рядка
  return 0;
  //успішне завершення програми

 }